Lesson-5-Nested/Practice-Problems.org
#+title: Lesson 5 Practice Problems
#+property: header-args:ruby :session ruby :results output pp :wrap example :exports both
#+options: num:nil toc:nil
#+setupfile: http://10.1.1.1:3000/grumpybear/org-themes/raw/branch/master/src/solarized_dark/solarized_dark.theme

* Problem 1
How would you order this array of number strings by descending numeric value?
#+begin_src ruby :results none
arr = ['10', '11', '9', '7', '8']
#+end_src
** Answer:
They can be easily ordered by numerical value by converting the strings to integers.
#+begin_src ruby :results output pp
p arr.sort_by {|n| n.to_i }.reverse
p arr.map {|n| n.to_i }.sort.map {|n| n.to_s}.reverse
#+end_src

#+RESULTS:
#+begin_example
["11", "10", "9", "8", "7"]
["11", "10", "9", "8", "7"]
#+end_example

** Official answer:
#+begin_src ruby :results value scalar
arr.sort { |a, b| b.to_i <=> a.to_i }
#+end_src

#+RESULTS:
#+begin_example
["11", "10", "9", "8", "7"]
#+end_example

* Problem 2
How would you order this array of hashes based on the year of publication of each book, from the earliest to the latest?
#+begin_src ruby :results none
books = [
  {title: 'One Hundred Years of Solitude', author: 'Gabriel Garcia Marquez', published: '1967'},
  {title: 'The Great Gatsby', author: 'F. Scott Fitzgerald', published: '1925'},
  {title: 'War and Peace', author: 'Leo Tolstoy', published: '1869'},
  {title: 'Ulysses', author: 'James Joyce', published: '1922'}
]
#+end_src

** Answer:
Convert the year strings to integers. No custom sorting needs to be done since teh default ~sort~ goes from least to greatest.
#+begin_src ruby :results value pp
books.sort_by do |book|
  book[:published].to_i
end
#+end_src

#+RESULTS:
#+begin_example
[{:title=>"War and Peace", :author=>"Leo Tolstoy", :published=>"1869"},
 {:title=>"Ulysses", :author=>"James Joyce", :published=>"1922"},
 {:title=>"The Great Gatsby", :author=>"F. Scott Fitzgerald", :published=>"1925"},
 {:title=>"One Hundred Years of Solitude", :author=>"Gabriel Garcia Marquez", :published=>"1967"}]
#+end_example

* Problem 3
For each of these collection objects demonstrate how you would reference the letter ~'g'~.
#+begin_src ruby :results none
arr1 = ['a', 'b', ['c', ['d', 'e', 'f', 'g']]]
arr2 = [{first: ['a', 'b', 'c'], second: ['d', 'e', 'f']}, {third: ['g', 'h', 'i']}]
arr3 = [['abc'], ['def'], {third: ['ghi']}]
hsh1 = {'a' => ['d', 'e'], 'b' => ['f', 'g'], 'c' => ['h', 'i']}
hsh2 = {first: {'d' => 3}, second: {'e' => 2, 'f' => 1}, third: {'g' => 0}}
#+end_src

** Answer
#+begin_src ruby :results output pp
p arr1[2][1][3]
p arr2[1][:third][0]
p arr3[2][:third][0][0]
p hsh1['b'][1]
p hsh2[:third].key(0)
#+end_src

#+RESULTS:
#+begin_example
"g"
"g"
"g"
"g"
"g"
#+end_example

* Problem 4
For each of these collection objects where the value ~3~ occurs, demonstrate how you would change this to ~4~.
#+begin_src ruby :results none
arr1 = [1, [2, 3], 4]
arr2 = [{a: 1}, {b: 2, c: [7, 6, 5], d: 4}, 3]
hsh1 = {first: [1, 2, [3]]}
hsh2 = {['a'] => {a: ['1', :two, 3], b: 4}, 'b' => 5}
#+end_src

** Answer
#+begin_src ruby :results output pp
arr1[1][1] = 4
arr2[2] = 4
hsh1[:first][2][0] = 4
hsh2[['a']][:a][2] = 4

p arr1
p arr2
p hsh1
p hsh2
#+end_src

#+RESULTS:
#+begin_example
[1, [2, 4], 4]
[{:a=>1}, {:b=>2, :c=>[7, 6, 5], :d=>4}, 4]
{:first=>[1, 2, [4]]}
{["a"]=>{:a=>["1", :two, 4], :b=>4}, "b"=>5}
#+end_example

