Lesson-5-Nested/Practice-Problems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-21 Fri 18:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 5 Practice Problems</title>
<meta name="author" content="Brady Stanton" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 5 Practice Problems</h1>

<div id="outline-container-org1b53bbd" class="outline-2">
<h2 id="org1b53bbd">Problem 1</h2>
<div class="outline-text-2" id="text-org1b53bbd">
<p>
How would you order this array of number strings by descending numeric value?
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr = [<span style="color: #2aa198;">'10'</span>, <span style="color: #2aa198;">'11'</span>, <span style="color: #2aa198;">'9'</span>, <span style="color: #2aa198;">'7'</span>, <span style="color: #2aa198;">'8'</span>]
</pre>
</div>
</div>
<div id="outline-container-org58f5533" class="outline-3">
<h3 id="org58f5533">Answer:</h3>
<div class="outline-text-3" id="text-org58f5533">
<p>
They can be easily ordered by numerical value by converting the strings to integers.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #268bd2;">p</span> arr.sort_by {|n| n.to_i }.reverse
<span style="color: #268bd2;">p</span> arr.map {|n| n.to_i }.sort.map {|n| n.to_s}.reverse
</pre>
</div>

<pre class="example" id="org1240298">
["11", "10", "9", "8", "7"]
["11", "10", "9", "8", "7"]
</pre>
</div>
</div>

<div id="outline-container-org2b97a5b" class="outline-3">
<h3 id="org2b97a5b">Official answer:</h3>
<div class="outline-text-3" id="text-org2b97a5b">
<div class="org-src-container">
<pre class="src src-ruby">arr.sort { |a, b| b.to_i &lt;=&gt; a.to_i }
</pre>
</div>

<pre class="example" id="org420f921">
["11", "10", "9", "8", "7"]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad01da8" class="outline-2">
<h2 id="orgad01da8">Problem 2</h2>
<div class="outline-text-2" id="text-orgad01da8">
<p>
How would you order this array of hashes based on the year of publication of each book, from the earliest to the latest?
</p>
<div class="org-src-container">
<pre class="src src-ruby">books = [
  {<span style="color: #d33682; font-weight: bold;">title:</span> <span style="color: #2aa198;">'One Hundred Years of Solitude'</span>, <span style="color: #d33682; font-weight: bold;">author:</span> <span style="color: #2aa198;">'Gabriel Garcia Marquez'</span>, <span style="color: #d33682; font-weight: bold;">published:</span> <span style="color: #2aa198;">'1967'</span>},
  {<span style="color: #d33682; font-weight: bold;">title:</span> <span style="color: #2aa198;">'The Great Gatsby'</span>, <span style="color: #d33682; font-weight: bold;">author:</span> <span style="color: #2aa198;">'F. Scott Fitzgerald'</span>, <span style="color: #d33682; font-weight: bold;">published:</span> <span style="color: #2aa198;">'1925'</span>},
  {<span style="color: #d33682; font-weight: bold;">title:</span> <span style="color: #2aa198;">'War and Peace'</span>, <span style="color: #d33682; font-weight: bold;">author:</span> <span style="color: #2aa198;">'Leo Tolstoy'</span>, <span style="color: #d33682; font-weight: bold;">published:</span> <span style="color: #2aa198;">'1869'</span>},
  {<span style="color: #d33682; font-weight: bold;">title:</span> <span style="color: #2aa198;">'Ulysses'</span>, <span style="color: #d33682; font-weight: bold;">author:</span> <span style="color: #2aa198;">'James Joyce'</span>, <span style="color: #d33682; font-weight: bold;">published:</span> <span style="color: #2aa198;">'1922'</span>}
]
</pre>
</div>
</div>

<div id="outline-container-org688487d" class="outline-3">
<h3 id="org688487d">Answer:</h3>
<div class="outline-text-3" id="text-org688487d">
<p>
Convert the year strings to integers. No custom sorting needs to be done since teh default <code>sort</code> goes from least to greatest.
</p>
<div class="org-src-container">
<pre class="src src-ruby">books.sort_by <span style="color: #859900; font-weight: bold;">do</span> |book|
  book[<span style="color: #d33682; font-weight: bold;">:published</span>].to_i
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org21d6911">
[{:title=&gt;"War and Peace", :author=&gt;"Leo Tolstoy", :published=&gt;"1869"},
 {:title=&gt;"Ulysses", :author=&gt;"James Joyce", :published=&gt;"1922"},
 {:title=&gt;"The Great Gatsby", :author=&gt;"F. Scott Fitzgerald", :published=&gt;"1925"},
 {:title=&gt;"One Hundred Years of Solitude", :author=&gt;"Gabriel Garcia Marquez", :published=&gt;"1967"}]
</pre>
</div>
</div>
</div>

<div id="outline-container-org731820f" class="outline-2">
<h2 id="org731820f">Problem 3</h2>
<div class="outline-text-2" id="text-org731820f">
<p>
For each of these collection objects demonstrate how you would reference the letter <code>'g'</code>.
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr1 = [<span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'b'</span>, [<span style="color: #2aa198;">'c'</span>, [<span style="color: #2aa198;">'d'</span>, <span style="color: #2aa198;">'e'</span>, <span style="color: #2aa198;">'f'</span>, <span style="color: #2aa198;">'g'</span>]]]
arr2 = [{<span style="color: #d33682; font-weight: bold;">first:</span> [<span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'b'</span>, <span style="color: #2aa198;">'c'</span>], <span style="color: #d33682; font-weight: bold;">second:</span> [<span style="color: #2aa198;">'d'</span>, <span style="color: #2aa198;">'e'</span>, <span style="color: #2aa198;">'f'</span>]}, {<span style="color: #d33682; font-weight: bold;">third:</span> [<span style="color: #2aa198;">'g'</span>, <span style="color: #2aa198;">'h'</span>, <span style="color: #2aa198;">'i'</span>]}]
arr3 = [[<span style="color: #2aa198;">'abc'</span>], [<span style="color: #2aa198;">'def'</span>], {<span style="color: #d33682; font-weight: bold;">third:</span> [<span style="color: #2aa198;">'ghi'</span>]}]
hsh1 = {<span style="color: #2aa198;">'a'</span> =&gt; [<span style="color: #2aa198;">'d'</span>, <span style="color: #2aa198;">'e'</span>], <span style="color: #2aa198;">'b'</span> =&gt; [<span style="color: #2aa198;">'f'</span>, <span style="color: #2aa198;">'g'</span>], <span style="color: #2aa198;">'c'</span> =&gt; [<span style="color: #2aa198;">'h'</span>, <span style="color: #2aa198;">'i'</span>]}
hsh2 = {<span style="color: #d33682; font-weight: bold;">first:</span> {<span style="color: #2aa198;">'d'</span> =&gt; <span style="color: #d33682; font-weight: bold;">3</span>}, <span style="color: #d33682; font-weight: bold;">second:</span> {<span style="color: #2aa198;">'e'</span> =&gt; <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #2aa198;">'f'</span> =&gt; <span style="color: #d33682; font-weight: bold;">1</span>}, <span style="color: #d33682; font-weight: bold;">third:</span> {<span style="color: #2aa198;">'g'</span> =&gt; <span style="color: #d33682; font-weight: bold;">0</span>}}
</pre>
</div>
</div>

<div id="outline-container-orgfeaa7dd" class="outline-3">
<h3 id="orgfeaa7dd">Answer</h3>
<div class="outline-text-3" id="text-orgfeaa7dd">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #268bd2;">p</span> arr1[<span style="color: #d33682; font-weight: bold;">2</span>][<span style="color: #d33682; font-weight: bold;">1</span>][<span style="color: #d33682; font-weight: bold;">3</span>]
<span style="color: #268bd2;">p</span> arr2[<span style="color: #d33682; font-weight: bold;">1</span>][<span style="color: #d33682; font-weight: bold;">:third</span>][<span style="color: #d33682; font-weight: bold;">0</span>]
<span style="color: #268bd2;">p</span> arr3[<span style="color: #d33682; font-weight: bold;">2</span>][<span style="color: #d33682; font-weight: bold;">:third</span>][<span style="color: #d33682; font-weight: bold;">0</span>][<span style="color: #d33682; font-weight: bold;">0</span>]
<span style="color: #268bd2;">p</span> hsh1[<span style="color: #2aa198;">'b'</span>][<span style="color: #d33682; font-weight: bold;">1</span>]
<span style="color: #268bd2;">p</span> hsh2[<span style="color: #d33682; font-weight: bold;">:third</span>].key(<span style="color: #d33682; font-weight: bold;">0</span>)
</pre>
</div>

<pre class="example" id="org16b237b">
"g"
"g"
"g"
"g"
"g"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb0a742" class="outline-2">
<h2 id="orgdb0a742">Problem 4</h2>
<div class="outline-text-2" id="text-orgdb0a742">
<p>
For each of these collection objects where the value <code>3</code> occurs, demonstrate how you would change this to <code>4</code>.
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr1 = [<span style="color: #d33682; font-weight: bold;">1</span>, [<span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>], <span style="color: #d33682; font-weight: bold;">4</span>]
arr2 = [{<span style="color: #d33682; font-weight: bold;">a:</span> <span style="color: #d33682; font-weight: bold;">1</span>}, {<span style="color: #d33682; font-weight: bold;">b:</span> <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">c:</span> [<span style="color: #d33682; font-weight: bold;">7</span>, <span style="color: #d33682; font-weight: bold;">6</span>, <span style="color: #d33682; font-weight: bold;">5</span>], <span style="color: #d33682; font-weight: bold;">d:</span> <span style="color: #d33682; font-weight: bold;">4</span>}, <span style="color: #d33682; font-weight: bold;">3</span>]
hsh1 = {<span style="color: #d33682; font-weight: bold;">first:</span> [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, [<span style="color: #d33682; font-weight: bold;">3</span>]]}
hsh2 = {[<span style="color: #2aa198;">'a'</span>] =&gt; {<span style="color: #d33682; font-weight: bold;">a:</span> [<span style="color: #2aa198;">'1'</span>, <span style="color: #d33682; font-weight: bold;">:two</span>, <span style="color: #d33682; font-weight: bold;">3</span>], <span style="color: #d33682; font-weight: bold;">b:</span> <span style="color: #d33682; font-weight: bold;">4</span>}, <span style="color: #2aa198;">'b'</span> =&gt; <span style="color: #d33682; font-weight: bold;">5</span>}
</pre>
</div>
</div>
