Lesson-5-Nested/Practice-Problems.org
* Problem 5
Given this nested Hash:
#+begin_src ruby :results none
munsters = {
  "Herman" => { "age" => 32, "gender" => "male" },
  "Lily" => { "age" => 30, "gender" => "female" },
  "Grandpa" => { "age" => 402, "gender" => "male" },
  "Eddie" => { "age" => 10, "gender" => "male" },
  "Marilyn" => { "age" => 23, "gender" => "female"}
}
#+end_src
figure out the total age of just the male members of the family.

** Answer
The slightly verbose but readable way without method-hunting
#+begin_src ruby
total_age = 0
munsters.each do |name, stats|
  if stats["gender"] == "male"
    total_age += stats["age"]
  end
end
p total_age
#+end_src

#+RESULTS:
#+begin_example
444
#+end_example

* Problem 6
One of the most frequently used real-world string properties is that of "string substitution", where we take a hard-coded string and modify it with various parameters from our program.
Given this previously seen family hash, print out the name, age and gender of each family member:
#+begin_src ruby :results none
munsters = {
  "Herman" => { "age" => 32, "gender" => "male" },
  "Lily" => { "age" => 30, "gender" => "female" },
  "Grandpa" => { "age" => 402, "gender" => "male" },
  "Eddie" => { "age" => 10, "gender" => "male" },
  "Marilyn" => { "age" => 23, "gender" => "female"}
}
#+end_src
...like this:
#+begin_src text :results none
(Name) is a (age)-year-old (male or female).
#+end_src

** Answer
#+begin_src ruby
munsters.each do |name, stats|
  puts "#{name} is a #{stats["age"]}-year-old #{stats["gender"]}"
end
#+end_src

#+RESULTS:
#+begin_example
Herman is a 32-year-old male
Lily is a 30-year-old female
Grandpa is a 402-year-old male
Eddie is a 10-year-old male
Marilyn is a 23-year-old female
#+end_example

* Problem 7
Given this code, what would be the final values of ~a~ and ~b~? Try to work this out without running the code.
#+begin_src ruby :results none
a = 2
b = [5, 8]
arr = [a, b]

arr[0] += 2
arr[1][0] -= a
#+end_src

** Answer
if the operators ~+=~ and ~-=~ do not mutate their caller (which is what I am assuming), then...
~a~ will be unchanged. When element ~0~ of ~arr~ is referenced, it is reassigned to the value of ~a + 2~, rather than assigning ~a~ to ~a + 2~ and assigning itself that resulting value of ~a~. In essence, the pointer at ~arr[0]~ is changed.
However, ~b~ will not fare the same. ~arr[1]~ directly references the object in its second index, but the object in its second index is an array. So ~arr[1][0]~ directly references ~b[0]~, rather than ~arr[1]~. Therefore when it is decremented by the value of a, ~b~ is mutated. ~b~'s final value will be ~[3, 8]~.

#+begin_src ruby
p a
p b
#+end_src

#+RESULTS:
#+begin_example
2
[3, 8]
#+end_example

* Problem 8
Using the ~each~ method, write some code to output all of the vowels from the strings.
#+begin_src ruby :results none
hsh = {first: ['the', 'quick'], second: ['brown', 'fox'], third: ['jumped'], fourth: ['over', 'the', 'lazy', 'dog']}
#+end_src

** Answer
#+begin_src ruby
vowels = ""
hsh.each do |key, word_arr|
  word_arr.each do |word|
    vowels += word.gsub(/[^aeiouy]/, '')
  end
end
p vowels
#+end_src

#+RESULTS:
#+begin_example
"euiooueoeeayo"
#+end_example


* Problem 9
Given this data structure, return a new array of the same structure but with the sub arrays being ordered (alphabetically or numerically as appropriate) in descending order.
#+begin_src ruby :results none
arr = [['b', 'c', 'a'], [2, 1, 3], ['blue', 'black', 'green']]
#+end_src

** Answer
Descending order: ~z,y,...,a~; ~9,8,...,1~
#+begin_src ruby :results value
arr.map do |subarr|
  subarr.sort {|a, b| b <=> a }
end
#+end_src

#+RESULTS:
#+begin_example
[["c", "b", "a"], [3, 2, 1], ["green", "blue", "black"]]
#+end_example

