Lesson-5-Nested/Practice-Problems.html

<div id="outline-container-org7b26ab0" class="outline-3">
<h3 id="org7b26ab0">Answer</h3>
<div class="outline-text-3" id="text-org7b26ab0">
<div class="org-src-container">
<pre class="src src-ruby">arr1[<span style="color: #d33682; font-weight: bold;">1</span>][<span style="color: #d33682; font-weight: bold;">1</span>] = <span style="color: #d33682; font-weight: bold;">4</span>
arr2[<span style="color: #d33682; font-weight: bold;">2</span>] = <span style="color: #d33682; font-weight: bold;">4</span>
hsh1[<span style="color: #d33682; font-weight: bold;">:first</span>][<span style="color: #d33682; font-weight: bold;">2</span>][<span style="color: #d33682; font-weight: bold;">0</span>] = <span style="color: #d33682; font-weight: bold;">4</span>
hsh2[[<span style="color: #2aa198;">'a'</span>]][<span style="color: #d33682; font-weight: bold;">:a</span>][<span style="color: #d33682; font-weight: bold;">2</span>] = <span style="color: #d33682; font-weight: bold;">4</span>

<span style="color: #268bd2;">p</span> arr1
<span style="color: #268bd2;">p</span> arr2
<span style="color: #268bd2;">p</span> hsh1
<span style="color: #268bd2;">p</span> hsh2
</pre>
</div>

<pre class="example" id="org27c2b25">
[1, [2, 4], 4]
[{:a=&gt;1}, {:b=&gt;2, :c=&gt;[7, 6, 5], :d=&gt;4}, 4]
{:first=&gt;[1, 2, [4]]}
{["a"]=&gt;{:a=&gt;["1", :two, 4], :b=&gt;4}, "b"=&gt;5}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a89222" class="outline-2">
<h2 id="org3a89222">Problem 5</h2>
<div class="outline-text-2" id="text-org3a89222">
<p>
Given this nested Hash:
</p>
<div class="org-src-container">
<pre class="src src-ruby">munsters = {
  <span style="color: #2aa198;">"Herman"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">32</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span> },
  <span style="color: #2aa198;">"Lily"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">30</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"female"</span> },
  <span style="color: #2aa198;">"Grandpa"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">402</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span> },
  <span style="color: #2aa198;">"Eddie"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">10</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span> },
  <span style="color: #2aa198;">"Marilyn"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">23</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"female"</span>}
}
</pre>
</div>
<p>
figure out the total age of just the male members of the family.
</p>
</div>

<div id="outline-container-org27dde6d" class="outline-3">
<h3 id="org27dde6d">Answer</h3>
<div class="outline-text-3" id="text-org27dde6d">
<p>
The slightly verbose but readable way without method-hunting
</p>
<div class="org-src-container">
<pre class="src src-ruby">total_age = <span style="color: #d33682; font-weight: bold;">0</span>
munsters.each <span style="color: #859900; font-weight: bold;">do</span> |name, stats|
  <span style="color: #859900; font-weight: bold;">if</span> stats[<span style="color: #2aa198;">"gender"</span>] == <span style="color: #2aa198;">"male"</span>
    total_age += stats[<span style="color: #2aa198;">"age"</span>]
  <span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #268bd2;">p</span> total_age
</pre>
</div>

<pre class="example" id="org8caf662">
444
</pre>
</div>
</div>
</div>

<div id="outline-container-org8dbfd45" class="outline-2">
<h2 id="org8dbfd45">Problem 6</h2>
<div class="outline-text-2" id="text-org8dbfd45">
<p>
One of the most frequently used real-world string properties is that of &ldquo;string substitution&rdquo;, where we take a hard-coded string and modify it with various parameters from our program.
Given this previously seen family hash, print out the name, age and gender of each family member:
</p>
<div class="org-src-container">
<pre class="src src-ruby">munsters = {
  <span style="color: #2aa198;">"Herman"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">32</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span> },
  <span style="color: #2aa198;">"Lily"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">30</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"female"</span> },
  <span style="color: #2aa198;">"Grandpa"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">402</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span> },
  <span style="color: #2aa198;">"Eddie"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">10</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"male"</span> },
  <span style="color: #2aa198;">"Marilyn"</span> =&gt; { <span style="color: #2aa198;">"age"</span> =&gt; <span style="color: #d33682; font-weight: bold;">23</span>, <span style="color: #2aa198;">"gender"</span> =&gt; <span style="color: #2aa198;">"female"</span>}
}
</pre>
</div>
<p>
&#x2026;like this:
</p>
<div class="org-src-container">
<pre class="src src-text">(Name) is a (age)-year-old (male or female).
</pre>
</div>
</div>

<div id="outline-container-org8ea6f2f" class="outline-3">
<h3 id="org8ea6f2f">Answer</h3>
<div class="outline-text-3" id="text-org8ea6f2f">
<div class="org-src-container">
<pre class="src src-ruby">munsters.each <span style="color: #859900; font-weight: bold;">do</span> |name, stats|
  <span style="color: #268bd2;">puts</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4;">#{name}</span><span style="color: #2aa198;"> is a </span><span style="color: #6c71c4;">#{stats["age"]}</span><span style="color: #2aa198;">-year-old </span><span style="color: #6c71c4;">#{stats["gender"]}</span><span style="color: #2aa198;">"</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org349a542">
Herman is a 32-year-old male
Lily is a 30-year-old female
Grandpa is a 402-year-old male
Eddie is a 10-year-old male
Marilyn is a 23-year-old female
</pre>
</div>
</div>
</div>

<div id="outline-container-orga35678d" class="outline-2">
<h2 id="orga35678d">Problem 7</h2>
<div class="outline-text-2" id="text-orga35678d">
<p>
Given this code, what would be the final values of <code>a</code> and <code>b</code>? Try to work this out without running the code.
</p>
<div class="org-src-container">
<pre class="src src-ruby">a = <span style="color: #d33682; font-weight: bold;">2</span>
b = [<span style="color: #d33682; font-weight: bold;">5</span>, <span style="color: #d33682; font-weight: bold;">8</span>]
arr = [a, b]

arr[<span style="color: #d33682; font-weight: bold;">0</span>] += <span style="color: #d33682; font-weight: bold;">2</span>
arr[<span style="color: #d33682; font-weight: bold;">1</span>][<span style="color: #d33682; font-weight: bold;">0</span>] -= a
</pre>
</div>
</div>

<div id="outline-container-org14b49f9" class="outline-3">
<h3 id="org14b49f9">Answer</h3>
<div class="outline-text-3" id="text-org14b49f9">
<p>
if the operators <code>+=</code> and <code>-=</code> do not mutate their caller (which is what I am assuming), then&#x2026;
<code>a</code> will be unchanged. When element <code>0</code> of <code>arr</code> is referenced, it is reassigned to the value of <code>a + 2</code>, rather than assigning <code>a</code> to <code>a + 2</code> and assigning itself that resulting value of <code>a</code>. In essence, the pointer at <code>arr[0]</code> is changed.
However, <code>b</code> will not fare the same. <code>arr[1]</code> directly references the object in its second index, but the object in its second index is an array. So <code>arr[1][0]</code> directly references <code>b[0]</code>, rather than <code>arr[1]</code>. Therefore when it is decremented by the value of a, <code>b</code> is mutated. <code>b</code>&rsquo;s final value will be <code>[3, 8]</code>.
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #268bd2;">p</span> a
<span style="color: #268bd2;">p</span> b
</pre>
</div>

<pre class="example" id="org1b9f457">
2
[3, 8]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac0fccb" class="outline-2">
<h2 id="orgac0fccb">Problem 8</h2>
<div class="outline-text-2" id="text-orgac0fccb">
<p>
Using the <code>each</code> method, write some code to output all of the vowels from the strings.
</p>
<div class="org-src-container">
<pre class="src src-ruby">hsh = {<span style="color: #d33682; font-weight: bold;">first:</span> [<span style="color: #2aa198;">'the'</span>, <span style="color: #2aa198;">'quick'</span>], <span style="color: #d33682; font-weight: bold;">second:</span> [<span style="color: #2aa198;">'brown'</span>, <span style="color: #2aa198;">'fox'</span>], <span style="color: #d33682; font-weight: bold;">third:</span> [<span style="color: #2aa198;">'jumped'</span>], <span style="color: #d33682; font-weight: bold;">fourth:</span> [<span style="color: #2aa198;">'over'</span>, <span style="color: #2aa198;">'the'</span>, <span style="color: #2aa198;">'lazy'</span>, <span style="color: #2aa198;">'dog'</span>]}
</pre>
</div>
</div>

<div id="outline-container-org9eb3f19" class="outline-3">
<h3 id="org9eb3f19">Answer</h3>
<div class="outline-text-3" id="text-org9eb3f19">
<div class="org-src-container">
<pre class="src src-ruby">vowels = <span style="color: #2aa198;">""</span>
hsh.each <span style="color: #859900; font-weight: bold;">do</span> |key, word_arr|
  word_arr.each <span style="color: #859900; font-weight: bold;">do</span> |word|
    vowels += word.gsub(<span style="color: #2aa198;">/[^aeiouy]/</span>, <span style="color: #2aa198;">''</span>)
  <span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #268bd2;">p</span> vowels
</pre>
</div>

<pre class="example" id="org423ec17">
"euiooueoeeayo"
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb31e5b8" class="outline-2">
<h2 id="orgb31e5b8">Problem 9</h2>
<div class="outline-text-2" id="text-orgb31e5b8">
<p>
Given this data structure, return a new array of the same structure but with the sub arrays being ordered (alphabetically or numerically as appropriate) in descending order.
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr = [[<span style="color: #2aa198;">'b'</span>, <span style="color: #2aa198;">'c'</span>, <span style="color: #2aa198;">'a'</span>], [<span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">3</span>], [<span style="color: #2aa198;">'blue'</span>, <span style="color: #2aa198;">'black'</span>, <span style="color: #2aa198;">'green'</span>]]
</pre>
</div>
</div>

<div id="outline-container-org12c78a1" class="outline-3">
<h3 id="org12c78a1">Answer</h3>
<div class="outline-text-3" id="text-org12c78a1">
<p>
Descending order: <code>z,y,...,a</code>; <code>9,8,...,1</code>
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr.map <span style="color: #859900; font-weight: bold;">do</span> |subarr|
  subarr.sort {|a, b| b &lt;=&gt; a }
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org2e95b14">
[["c", "b", "a"], [3, 2, 1], ["green", "blue", "black"]]
</pre>
</div>
</div>
</div>
