Lesson-5-Nested/Practice-Problems.org
* Problem 10
Given the following data structure and without modifying the original array, use the ~map~ method to return a new array identical in structure to the original but where the value of each integer is incremented by 1.
#+begin_src ruby :results none
[{a: 1}, {b: 2, c: 3}, {d: 4, e: 5, f: 6}]
#+end_src

** Answer
Observation: every integer is the value of a key in a hash. There are no integer keys, only integer key-values.
#+begin_src ruby :results value
arr = [{a: 1}, {b: 2, c: 3}, {d: 4, e: 5, f: 6}]
arr.map do |el|
  copy = {}
  el.each_pair {|k,v| copy[k] = v + 1}
  copy
end
#+end_src

#+RESULTS:
#+begin_example
[{:a=>2}, {:b=>3, :c=>4}, {:d=>5, :e=>6, :f=>7}]
#+end_example

#+begin_src ruby :results value
arr
#+end_src

#+RESULTS:
#+begin_example
[{:a=>1}, {:b=>2, :c=>3}, {:d=>4, :e=>5, :f=>6}]
#+end_example

* Problem 11
Given the following data structure use a combination of methods, including either the ~select~ or ~reject~ method, to return a new array identical in structure to the original but containing only the integers that are multiples of ~3~.
#+begin_src ruby :results none
arr = [[2], [3, 5, 7], [9], [11, 13, 15]]
#+end_src

** Solution
#+begin_src ruby :results value
arr.map do |subarr|
  subarr.map do |el|
    el if el % 3 == 0
  end
  .select {|e| e != nil }
end
#+end_src

#+RESULTS:
#+begin_example
[[], [3], [9], [15]]
#+end_example

Simpler solution would be
#+begin_src ruby :results value
arr.map do |el|
  el.select do |n|
    n % 3 == 0
  end
end
#+end_src

#+RESULTS:
#+begin_example
[[], [3], [9], [15]]
#+end_example

* Problem 12
Given the following data structure, and /without/ using the ~Array#to_h~ method, write some code that will return a hash where the key is the first item in each sub array and the value is the second item.
#+begin_src ruby :results none
arr = [[:a, 1], ['b', 'two'], ['sea', {c: 3}], [{a: 1, b: 2, c: 3, d: 4}, 'D']]
# expected return value: {:a=>1, "b"=>"two", "sea"=>{:c=>3}, {:a=>1, :b=>2, :c=>3, :d=>4}=>"D"}
#+end_src

** Solution
Observation: ~arr~ is an array of arrays. Each subarray in ~arr~ is composed of only two members, regardless of member type. We will not worry about any level deeper than this.
#+begin_src ruby :results value
def my_array_to_hash(arr)
  hash = {}
  arr.each do |el|
    hash[el[0]] = el[1]
  end
  hash
end
my_array_to_hash(arr)
#+end_src

#+RESULTS:
#+begin_example
{:a=>1, "b"=>"two", "sea"=>{:c=>3}, {:a=>1, :b=>2, :c=>3, :d=>4}=>"D"}
#+end_example

* Problem 13
Given the following data structure, return a new array containing the same sub-arrays as the original but ordered logically by only taking into consideration the /odd/ numbers they contain.
#+begin_src ruby :results none
arr = [[1, 6, 9], [1, 4, 9], [1, 6, 7], [1, 8, 3]]
#+end_src
The sorted array should look like this:
#+begin_src ruby :results none
[[1, 8, 3], [1, 6, 7], [1, 4, 9], [1, 6, 9]]
#+end_src

** Solution
What happens when two elements have the same odd numbers, but different even numbers? Does the order between the two matter? For example, does it matter if ~[1, 4, 9]~ comes before ~[1, 6, 9]~ or not?
#+begin_src ruby :results value
arr.sort_by do |el|
  el.select {|n| n.odd?}
end
#+end_src

#+RESULTS:
#+begin_example
[[1, 8, 3], [1, 6, 7], [1, 6, 9], [1, 4, 9]]
#+end_example

It appears that the result I got was the same as the official solution, even though both differ from the "should look like this" presented in the problem description.

