Lesson-5-Nested/Practice-Problems.html

<div id="outline-container-orgf292977" class="outline-2">
<h2 id="orgf292977">Problem 10</h2>
<div class="outline-text-2" id="text-orgf292977">
<p>
Given the following data structure and without modifying the original array, use the <code>map</code> method to return a new array identical in structure to the original but where the value of each integer is incremented by 1.
</p>
<div class="org-src-container">
<pre class="src src-ruby">[{<span style="color: #d33682; font-weight: bold;">a:</span> <span style="color: #d33682; font-weight: bold;">1</span>}, {<span style="color: #d33682; font-weight: bold;">b:</span> <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">c:</span> <span style="color: #d33682; font-weight: bold;">3</span>}, {<span style="color: #d33682; font-weight: bold;">d:</span> <span style="color: #d33682; font-weight: bold;">4</span>, <span style="color: #d33682; font-weight: bold;">e:</span> <span style="color: #d33682; font-weight: bold;">5</span>, <span style="color: #d33682; font-weight: bold;">f:</span> <span style="color: #d33682; font-weight: bold;">6</span>}]
</pre>
</div>
</div>

<div id="outline-container-org8e90d4d" class="outline-3">
<h3 id="org8e90d4d">Answer</h3>
<div class="outline-text-3" id="text-org8e90d4d">
<p>
Observation: every integer is the value of a key in a hash. There are no integer keys, only integer key-values.
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr = [{<span style="color: #d33682; font-weight: bold;">a:</span> <span style="color: #d33682; font-weight: bold;">1</span>}, {<span style="color: #d33682; font-weight: bold;">b:</span> <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">c:</span> <span style="color: #d33682; font-weight: bold;">3</span>}, {<span style="color: #d33682; font-weight: bold;">d:</span> <span style="color: #d33682; font-weight: bold;">4</span>, <span style="color: #d33682; font-weight: bold;">e:</span> <span style="color: #d33682; font-weight: bold;">5</span>, <span style="color: #d33682; font-weight: bold;">f:</span> <span style="color: #d33682; font-weight: bold;">6</span>}]
arr.map <span style="color: #859900; font-weight: bold;">do</span> |el|
  copy = {}
  el.each_pair {|k,v| copy[k] = v + <span style="color: #d33682; font-weight: bold;">1</span>}
  copy
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org88ae674">
[{:a=&gt;2}, {:b=&gt;3, :c=&gt;4}, {:d=&gt;5, :e=&gt;6, :f=&gt;7}]
</pre>

<div class="org-src-container">
<pre class="src src-ruby">arr
</pre>
</div>

<pre class="example" id="orgb553875">
[{:a=&gt;1}, {:b=&gt;2, :c=&gt;3}, {:d=&gt;4, :e=&gt;5, :f=&gt;6}]
</pre>
</div>
</div>
</div>

<div id="outline-container-org504710a" class="outline-2">
<h2 id="org504710a">Problem 11</h2>
<div class="outline-text-2" id="text-org504710a">
<p>
Given the following data structure use a combination of methods, including either the <code>select</code> or <code>reject</code> method, to return a new array identical in structure to the original but containing only the integers that are multiples of <code>3</code>.
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr = [[<span style="color: #d33682; font-weight: bold;">2</span>], [<span style="color: #d33682; font-weight: bold;">3</span>, <span style="color: #d33682; font-weight: bold;">5</span>, <span style="color: #d33682; font-weight: bold;">7</span>], [<span style="color: #d33682; font-weight: bold;">9</span>], [<span style="color: #d33682; font-weight: bold;">11</span>, <span style="color: #d33682; font-weight: bold;">13</span>, <span style="color: #d33682; font-weight: bold;">15</span>]]
</pre>
</div>
</div>

<div id="outline-container-orgfb4435a" class="outline-3">
<h3 id="orgfb4435a">Solution</h3>
<div class="outline-text-3" id="text-orgfb4435a">
<div class="org-src-container">
<pre class="src src-ruby">arr.map <span style="color: #859900; font-weight: bold;">do</span> |subarr|
  subarr.map <span style="color: #859900; font-weight: bold;">do</span> |el|
    el <span style="color: #859900; font-weight: bold;">if</span> el % <span style="color: #d33682; font-weight: bold;">3</span> == <span style="color: #d33682; font-weight: bold;">0</span>
  <span style="color: #859900; font-weight: bold;">end</span>
  .select {|e| e != <span style="color: #d33682; font-weight: bold;">nil</span> }
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="orge85c4ae">
[[], [3], [9], [15]]
</pre>

<p>
Simpler solution would be
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr.map <span style="color: #859900; font-weight: bold;">do</span> |el|
  el.select <span style="color: #859900; font-weight: bold;">do</span> |n|
    n % <span style="color: #d33682; font-weight: bold;">3</span> == <span style="color: #d33682; font-weight: bold;">0</span>
  <span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org9a9f1a1">
[[], [3], [9], [15]]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0eb30d" class="outline-2">
<h2 id="orgd0eb30d">Problem 12</h2>
<div class="outline-text-2" id="text-orgd0eb30d">
<p>
Given the following data structure, and <i>without</i> using the <code>Array#to_h</code> method, write some code that will return a hash where the key is the first item in each sub array and the value is the second item.
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr = [[<span style="color: #d33682; font-weight: bold;">:a</span>, <span style="color: #d33682; font-weight: bold;">1</span>], [<span style="color: #2aa198;">'b'</span>, <span style="color: #2aa198;">'two'</span>], [<span style="color: #2aa198;">'sea'</span>, {<span style="color: #d33682; font-weight: bold;">c:</span> <span style="color: #d33682; font-weight: bold;">3</span>}], [{<span style="color: #d33682; font-weight: bold;">a:</span> <span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">b:</span> <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">c:</span> <span style="color: #d33682; font-weight: bold;">3</span>, <span style="color: #d33682; font-weight: bold;">d:</span> <span style="color: #d33682; font-weight: bold;">4</span>}, <span style="color: #2aa198;">'D'</span>]]
<span style="color: #405A61;"># </span><span style="color: #405A61;">expected return value: {:a=&gt;1, "b"=&gt;"two", "sea"=&gt;{:c=&gt;3}, {:a=&gt;1, :b=&gt;2, :c=&gt;3, :d=&gt;4}=&gt;"D"}</span>
</pre>
</div>
</div>

<div id="outline-container-org31067f6" class="outline-3">
<h3 id="org31067f6">Solution</h3>
<div class="outline-text-3" id="text-org31067f6">
<p>
Observation: <code>arr</code> is an array of arrays. Each subarray in <code>arr</code> is composed of only two members, regardless of member type. We will not worry about any level deeper than this.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">my_array_to_hash</span>(arr)
  hash = {}
  arr.each <span style="color: #859900; font-weight: bold;">do</span> |el|
    hash[el[<span style="color: #d33682; font-weight: bold;">0</span>]] = el[<span style="color: #d33682; font-weight: bold;">1</span>]
  <span style="color: #859900; font-weight: bold;">end</span>
  hash
<span style="color: #859900; font-weight: bold;">end</span>
my_array_to_hash(arr)
</pre>
</div>

<pre class="example" id="orga95ff5e">
{:a=&gt;1, "b"=&gt;"two", "sea"=&gt;{:c=&gt;3}, {:a=&gt;1, :b=&gt;2, :c=&gt;3, :d=&gt;4}=&gt;"D"}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ebbc57" class="outline-2">
<h2 id="org5ebbc57">Problem 13</h2>
<div class="outline-text-2" id="text-org5ebbc57">
<p>
Given the following data structure, return a new array containing the same sub-arrays as the original but ordered logically by only taking into consideration the <i>odd</i> numbers they contain.
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr = [[<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">6</span>, <span style="color: #d33682; font-weight: bold;">9</span>], [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">4</span>, <span style="color: #d33682; font-weight: bold;">9</span>], [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">6</span>, <span style="color: #d33682; font-weight: bold;">7</span>], [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">8</span>, <span style="color: #d33682; font-weight: bold;">3</span>]]
</pre>
</div>
<p>
The sorted array should look like this:
</p>
<div class="org-src-container">
<pre class="src src-ruby">[[<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">8</span>, <span style="color: #d33682; font-weight: bold;">3</span>], [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">6</span>, <span style="color: #d33682; font-weight: bold;">7</span>], [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">4</span>, <span style="color: #d33682; font-weight: bold;">9</span>], [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">6</span>, <span style="color: #d33682; font-weight: bold;">9</span>]]
</pre>
</div>
</div>

<div id="outline-container-org4904500" class="outline-3">
<h3 id="org4904500">Solution</h3>
<div class="outline-text-3" id="text-org4904500">
<p>
What happens when two elements have the same odd numbers, but different even numbers? Does the order between the two matter? For example, does it matter if <code>[1, 4, 9]</code> comes before <code>[1, 6, 9]</code> or not?
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr.sort_by <span style="color: #859900; font-weight: bold;">do</span> |el|
  el.select {|n| n.odd?}
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="orgac11ad7">
[[1, 8, 3], [1, 6, 7], [1, 6, 9], [1, 4, 9]]
</pre>

<p>
It appears that the result I got was the same as the official solution, even though both differ from the &ldquo;should look like this&rdquo; presented in the problem description.
</p>
</div>
</div>
</div>
