Lesson-5-Nested/Practice-Problems.org
* Problem 14
Given this data structure write some code to return an array containing the colors of the fruits and the sizes of the vegetables. The sizes should be uppercase and the colors should be capitalized.
#+begin_src ruby :results none
hsh = {
  'grape' => {type: 'fruit', colors: ['red', 'green'], size: 'small'},
  'carrot' => {type: 'vegetable', colors: ['orange'], size: 'medium'},
  'apple' => {type: 'fruit', colors: ['red', 'green'], size: 'medium'},
  'apricot' => {type: 'fruit', colors: ['orange'], size: 'medium'},
  'marrow' => {type: 'vegetable', colors: ['green'], size: 'large'},
}
#+end_src
The return value should look like this:
#+begin_src ruby :results none
[["Red", "Green"], "MEDIUM", ["Red", "Green"], ["Orange"], "LARGE"]
#+end_src

** Solution
#+begin_src ruby
arr = []
hsh.each_value do |traits|
  if traits[:type] == 'fruit'
    arr << traits[:colors].map {|p| p.capitalize }
  else
    arr << traits[:size].upcase
  end
end
p arr
#+end_src

#+RESULTS:
#+begin_example
[["Red", "Green"], "MEDIUM", ["Red", "Green"], ["Orange"], "LARGE"]
#+end_example

We can also call ~Hash#map~ to convert our hash into an array!
#+begin_src ruby :results value
hsh.map do |_, traits|
  if traits[:type] == 'fruit'
    traits[:colors].map {|c| c.capitalize}
  elsif traits[:type] == 'vegetable'
    traits[:size].upcase
  end
end
#+end_src

#+RESULTS:
#+begin_example
[["Red", "Green"], "MEDIUM", ["Red", "Green"], ["Orange"], "LARGE"]
#+end_example

* Problem 15
Given this data structure write some code to return an array which contains only the hashes where all the integers are even.
#+begin_src ruby :results none
arr = [{a: [1, 2, 3]}, {b: [2, 4, 6], c: [3, 6], d: [4]}, {e: [8], f: [6, 10]}]
#+end_src

** Solution
#+begin_src ruby :results value pp
arr.select do |hsh|
  not hsh.values.any? {|arr| arr.any? {|e| e.odd?}}
end
#+end_src

#+RESULTS:
#+begin_example
[{:e=>[8], :f=>[6, 10]}]
#+end_example

* Problem 16
A UUID is a type of identifier often used as a way to uniquely identify items...which may not all be created by the same system. That is, without any form of synchronization, two or more separate computer systems can create new items and label them with a UUID with no significant chance of stepping on each other's toes.

It accomplishes this feat through massive randomization. The number of possible UUID values is approximately 3.4 X 10E38.

Each UUID consists of 32 hexadecimal characters, and is typically broken into 5 sections like this 8-4-4-4-12 and represented as a string.

It looks like this: ~"f65c57f6-a6aa-17a8-faa1-a67f2dc9fa91"~

Write a method that returns one UUID when called with no parameters.

** Solution
#+begin_src ruby
def uuid
  uuid = ""
  uuid << Random.rand(16**8 - 1).to_s(16)
  uuid << "-"
  uuid << Random.rand(16**4 - 1).to_s(16)
  uuid << "-"
  uuid << Random.rand(16**4 - 1).to_s(16)
  uuid << "-"
  uuid << Random.rand(16**4 - 1).to_s(16)
  uuid << "-"
  uuid << Random.rand(16**12 - 1).to_s(16)
  uuid
end
uuid()

def uuid2
  uuid = ""
  32.times do
    uuid << Random.rand(16).to_s(16)
  end
  uuid[0..7] + '-' + uuid[8..11] + '-' + uuid[12..15] + '-' + uuid[16..19] + '-' + uuid[20..]
end
puts uuid()
puts uuid2()
#+end_src

#+RESULTS:
#+begin_example
6ca22a0-11d8-d6a5-4e20-9c48b0b7a017
d0fa171e-ad7c-c9e7-f18c-bf867bcbbccd
#+end_example
