Lesson-5-Nested/Practice-Problems.html

<div id="outline-container-org4455e31" class="outline-2">
<h2 id="org4455e31">Problem 14</h2>
<div class="outline-text-2" id="text-org4455e31">
<p>
Given this data structure write some code to return an array containing the colors of the fruits and the sizes of the vegetables. The sizes should be uppercase and the colors should be capitalized.
</p>
<div class="org-src-container">
<pre class="src src-ruby">hsh = {
  <span style="color: #2aa198;">'grape'</span> =&gt; {<span style="color: #d33682; font-weight: bold;">type:</span> <span style="color: #2aa198;">'fruit'</span>, <span style="color: #d33682; font-weight: bold;">colors:</span> [<span style="color: #2aa198;">'red'</span>, <span style="color: #2aa198;">'green'</span>], <span style="color: #d33682; font-weight: bold;">size:</span> <span style="color: #2aa198;">'small'</span>},
  <span style="color: #2aa198;">'carrot'</span> =&gt; {<span style="color: #d33682; font-weight: bold;">type:</span> <span style="color: #2aa198;">'vegetable'</span>, <span style="color: #d33682; font-weight: bold;">colors:</span> [<span style="color: #2aa198;">'orange'</span>], <span style="color: #d33682; font-weight: bold;">size:</span> <span style="color: #2aa198;">'medium'</span>},
  <span style="color: #2aa198;">'apple'</span> =&gt; {<span style="color: #d33682; font-weight: bold;">type:</span> <span style="color: #2aa198;">'fruit'</span>, <span style="color: #d33682; font-weight: bold;">colors:</span> [<span style="color: #2aa198;">'red'</span>, <span style="color: #2aa198;">'green'</span>], <span style="color: #d33682; font-weight: bold;">size:</span> <span style="color: #2aa198;">'medium'</span>},
  <span style="color: #2aa198;">'apricot'</span> =&gt; {<span style="color: #d33682; font-weight: bold;">type:</span> <span style="color: #2aa198;">'fruit'</span>, <span style="color: #d33682; font-weight: bold;">colors:</span> [<span style="color: #2aa198;">'orange'</span>], <span style="color: #d33682; font-weight: bold;">size:</span> <span style="color: #2aa198;">'medium'</span>},
  <span style="color: #2aa198;">'marrow'</span> =&gt; {<span style="color: #d33682; font-weight: bold;">type:</span> <span style="color: #2aa198;">'vegetable'</span>, <span style="color: #d33682; font-weight: bold;">colors:</span> [<span style="color: #2aa198;">'green'</span>], <span style="color: #d33682; font-weight: bold;">size:</span> <span style="color: #2aa198;">'large'</span>},
}
</pre>
</div>
<p>
The return value should look like this:
</p>
<div class="org-src-container">
<pre class="src src-ruby">[[<span style="color: #2aa198;">"Red"</span>, <span style="color: #2aa198;">"Green"</span>], <span style="color: #2aa198;">"MEDIUM"</span>, [<span style="color: #2aa198;">"Red"</span>, <span style="color: #2aa198;">"Green"</span>], [<span style="color: #2aa198;">"Orange"</span>], <span style="color: #2aa198;">"LARGE"</span>]
</pre>
</div>
</div>

<div id="outline-container-org285d7af" class="outline-3">
<h3 id="org285d7af">Solution</h3>
<div class="outline-text-3" id="text-org285d7af">
<div class="org-src-container">
<pre class="src src-ruby">arr = []
hsh.each_value <span style="color: #859900; font-weight: bold;">do</span> |traits|
  <span style="color: #859900; font-weight: bold;">if</span> traits[<span style="color: #d33682; font-weight: bold;">:type</span>] == <span style="color: #2aa198;">'fruit'</span>
    arr &lt;&lt; traits[<span style="color: #d33682; font-weight: bold;">:colors</span>].map {|p| p.capitalize }
  <span style="color: #859900; font-weight: bold;">else</span>
    arr &lt;&lt; traits[<span style="color: #d33682; font-weight: bold;">:size</span>].upcase
  <span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #268bd2;">p</span> arr
</pre>
</div>

<pre class="example" id="org7cfae0f">
[["Red", "Green"], "MEDIUM", ["Red", "Green"], ["Orange"], "LARGE"]
</pre>

<p>
We can also call <code>Hash#map</code> to convert our hash into an array!
</p>
<div class="org-src-container">
<pre class="src src-ruby">hsh.map <span style="color: #859900; font-weight: bold;">do</span> |_, traits|
  <span style="color: #859900; font-weight: bold;">if</span> traits[<span style="color: #d33682; font-weight: bold;">:type</span>] == <span style="color: #2aa198;">'fruit'</span>
    traits[<span style="color: #d33682; font-weight: bold;">:colors</span>].map {|c| c.capitalize}
  <span style="color: #859900; font-weight: bold;">elsif</span> traits[<span style="color: #d33682; font-weight: bold;">:type</span>] == <span style="color: #2aa198;">'vegetable'</span>
    traits[<span style="color: #d33682; font-weight: bold;">:size</span>].upcase
  <span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org486ff08">
[["Red", "Green"], "MEDIUM", ["Red", "Green"], ["Orange"], "LARGE"]
</pre>
</div>
</div>
</div>

<div id="outline-container-org63f716e" class="outline-2">
<h2 id="org63f716e">Problem 15</h2>
<div class="outline-text-2" id="text-org63f716e">
<p>
Given this data structure write some code to return an array which contains only the hashes where all the integers are even.
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr = [{<span style="color: #d33682; font-weight: bold;">a:</span> [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>]}, {<span style="color: #d33682; font-weight: bold;">b:</span> [<span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">4</span>, <span style="color: #d33682; font-weight: bold;">6</span>], <span style="color: #d33682; font-weight: bold;">c:</span> [<span style="color: #d33682; font-weight: bold;">3</span>, <span style="color: #d33682; font-weight: bold;">6</span>], <span style="color: #d33682; font-weight: bold;">d:</span> [<span style="color: #d33682; font-weight: bold;">4</span>]}, {<span style="color: #d33682; font-weight: bold;">e:</span> [<span style="color: #d33682; font-weight: bold;">8</span>], <span style="color: #d33682; font-weight: bold;">f:</span> [<span style="color: #d33682; font-weight: bold;">6</span>, <span style="color: #d33682; font-weight: bold;">10</span>]}]
</pre>
</div>
</div>

<div id="outline-container-orgab6f03e" class="outline-3">
<h3 id="orgab6f03e">Solution</h3>
<div class="outline-text-3" id="text-orgab6f03e">
<div class="org-src-container">
<pre class="src src-ruby">arr.select <span style="color: #859900; font-weight: bold;">do</span> |hsh|
  <span style="color: #859900; font-weight: bold;">not</span> hsh.values.any? {|arr| arr.any? {|e| e.odd?}}
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org0fbd6de">
[{:e=&gt;[8], :f=&gt;[6, 10]}]
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a96ae3" class="outline-2">
<h2 id="org3a96ae3">Problem 16</h2>
<div class="outline-text-2" id="text-org3a96ae3">
<p>
A UUID is a type of identifier often used as a way to uniquely identify items&#x2026;which may not all be created by the same system. That is, without any form of synchronization, two or more separate computer systems can create new items and label them with a UUID with no significant chance of stepping on each other&rsquo;s toes.
</p>

<p>
It accomplishes this feat through massive randomization. The number of possible UUID values is approximately 3.4 X 10E38.
</p>

<p>
Each UUID consists of 32 hexadecimal characters, and is typically broken into 5 sections like this 8-4-4-4-12 and represented as a string.
</p>

<p>
It looks like this: <code>"f65c57f6-a6aa-17a8-faa1-a67f2dc9fa91"</code>
</p>

<p>
Write a method that returns one UUID when called with no parameters.
</p>
</div>

<div id="outline-container-org7adfbae" class="outline-3">
<h3 id="org7adfbae">Solution</h3>
<div class="outline-text-3" id="text-org7adfbae">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">uuid</span>
  uuid = <span style="color: #2aa198;">""</span>
  uuid &lt;&lt; <span style="color: #b58900;">Random</span>.rand(<span style="color: #d33682; font-weight: bold;">16</span>**<span style="color: #d33682; font-weight: bold;">8</span> - <span style="color: #d33682; font-weight: bold;">1</span>).to_s(<span style="color: #d33682; font-weight: bold;">16</span>)
  uuid &lt;&lt; <span style="color: #2aa198;">"-"</span>
  uuid &lt;&lt; <span style="color: #b58900;">Random</span>.rand(<span style="color: #d33682; font-weight: bold;">16</span>**<span style="color: #d33682; font-weight: bold;">4</span> - <span style="color: #d33682; font-weight: bold;">1</span>).to_s(<span style="color: #d33682; font-weight: bold;">16</span>)
  uuid &lt;&lt; <span style="color: #2aa198;">"-"</span>
  uuid &lt;&lt; <span style="color: #b58900;">Random</span>.rand(<span style="color: #d33682; font-weight: bold;">16</span>**<span style="color: #d33682; font-weight: bold;">4</span> - <span style="color: #d33682; font-weight: bold;">1</span>).to_s(<span style="color: #d33682; font-weight: bold;">16</span>)
  uuid &lt;&lt; <span style="color: #2aa198;">"-"</span>
  uuid &lt;&lt; <span style="color: #b58900;">Random</span>.rand(<span style="color: #d33682; font-weight: bold;">16</span>**<span style="color: #d33682; font-weight: bold;">4</span> - <span style="color: #d33682; font-weight: bold;">1</span>).to_s(<span style="color: #d33682; font-weight: bold;">16</span>)
  uuid &lt;&lt; <span style="color: #2aa198;">"-"</span>
  uuid &lt;&lt; <span style="color: #b58900;">Random</span>.rand(<span style="color: #d33682; font-weight: bold;">16</span>**<span style="color: #d33682; font-weight: bold;">12</span> - <span style="color: #d33682; font-weight: bold;">1</span>).to_s(<span style="color: #d33682; font-weight: bold;">16</span>)
  uuid
<span style="color: #859900; font-weight: bold;">end</span>
uuid()

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">uuid2</span>
  uuid = <span style="color: #2aa198;">""</span>
  <span style="color: #d33682; font-weight: bold;">32</span>.times <span style="color: #859900; font-weight: bold;">do</span>
    uuid &lt;&lt; <span style="color: #b58900;">Random</span>.rand(<span style="color: #d33682; font-weight: bold;">16</span>).to_s(<span style="color: #d33682; font-weight: bold;">16</span>)
  <span style="color: #859900; font-weight: bold;">end</span>
  uuid[<span style="color: #d33682; font-weight: bold;">0</span>..<span style="color: #d33682; font-weight: bold;">7</span>] + <span style="color: #2aa198;">'-'</span> + uuid[<span style="color: #d33682; font-weight: bold;">8</span>..<span style="color: #d33682; font-weight: bold;">11</span>] + <span style="color: #2aa198;">'-'</span> + uuid[<span style="color: #d33682; font-weight: bold;">12</span>..<span style="color: #d33682; font-weight: bold;">15</span>] + <span style="color: #2aa198;">'-'</span> + uuid[<span style="color: #d33682; font-weight: bold;">16</span>..<span style="color: #d33682; font-weight: bold;">19</span>] + <span style="color: #2aa198;">'-'</span> + uuid[<span style="color: #d33682; font-weight: bold;">20</span>..]
<span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #268bd2;">puts</span> uuid()
<span style="color: #268bd2;">puts</span> uuid2()
</pre>
</div>

<pre class="example" id="org04cc677">
d75a7df6-401b-e24d-c14f-87b771fe01b6
f6bb0961-d02f-b059-7c65-d82641237986
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brady Stanton</p>
<p class="date">Created: 2022-01-21 Fri 18:31</p>
</div>
</body>
</html>
